Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: The first way, ?php...?, is the preferred method, as it allows the use of PHP in XML-conformant code such as XHTML.
es: El método primero, ?php...?, es el más conveniente, ya que permite el uso de PHP en código XML como XHTML.

source: The second way is not available always.
es: El método segundo no siempre está disponible.

source: This can be done via the short_tags() function (PHP 3 only), by enabling the short_open_tag configuration setting in the PHP config file, or by compiling PHP with the --enable-short-tags option to configure.
es: El formato corto de etiquetas está disponible con la función short_tags() (sólo PHP 3), activando el parámetro del fichero de configuración de PHP short_open_tag, o compilando PHP con la opción --enable-short-tags del comando configure.

source: Even if it is enabled by default in php.ini-dist, use of short tags are discouraged.
es: Aunque esté activa por defecto en php.ini-dist, se desaconseja el uso del formato de etiquetas corto.

source: The fourth way is only available if ASP-style tags have been enabled using the asp_tags configuration setting.
es: El método cuarto sólo está disponible si se han activado las etiquetas ASP en el fichero de configuración: asp_tags.

source: Support for ASP-style tags was added in 3.0.4.
es: El soporte de etiquetas ASP se añadió en la versión 3.0.4.

source: Using short tags should be avoided when developing applications or libraries that are meant for redistribution, or deployment on PHP servers which are not under your control, because short tags may not be supported on the target server.
es: No se debe usar el formato corto de etiquetas cuando se desarrollen aplicaciones o librerías con intención de redistribuirlas, o cuando se desarrolle para servidores que no están bajo nuestro control, porque puede ser que el formato corto de etiquetas no esté soportado en el servidor.

source: For portable, redistributable code, be sure not to use short tags.
es: Para generar código portable y redistribuíble, asegúrate de no usar el formato corto de etiquetas.

source: The closing tag for the block will include the immediately trailing newline if one is present.
es: La etiqueta de fin de bloque incluirá tras ella la siguiente línea si hay alguna presente.

source: Also, the closing tag automatically implies a semicolon; you do not need to have a semicolon terminating the last line of a PHP block.
es: Además, la etiqueta de fin de bloque lleva implícito el punto y coma; no necesitas por lo tanto añadir el punto y coma final de la última línea del bloque PHP.

source: PHP allows you to use structures like this:
es: PHP permite estructurar bloques como:

source: Example 6-2.
es: Ejemplo 6-2.

source: Advanced escaping
es: Métodos avanzados de escape

source: Language Reference
es: Referencia del Lenguaje

source: Instructions are separated the same as in C or Perl - terminate each statement with a semicolon.
es: Las separación de instrucciones se hace de la misma manera que en C o Perl - terminando cada declaración con un punto y coma.

source: The closing tag (?) also implies the end of the statement, so the following are equivalent:
es: La etiqueta de fin de bloque (?) implica el fin de la declaración, por lo tanto lo siguiente es equivalente:

source: Comments
es: Comentarios

source: A constant is a identifier (name) for a simple value.
es: Una constante es un identificador para expresar un valor simple.

source: As the name suggests, that value cannot change during the execution of the script (except the magic constants As the name suggests, that value cannot change during the execution of the script (except the magic constants which aren't actually constants).
es: Como el nombre sugiere, este valor no puede variar durante la ejecución del script. (Las constantes especiales __FILE__ y __LINE__ son una excepción a esto, ya que actualmente no lo soin).

source: A constant is case-sensitive by default.
es: Una constante es sensible a mayúsculas por defecto.

source: By convention constant identifiers are always uppercase.
es: Por convención, los identificadores de constantes suelen declararse en mayúsculas

source: The name of a constant follows the same rules as any label in PHP.
es: El nombre de una constante sigue las mismas reglas que cualquier etiqueta en PHP.

source: A valid constant name starts with a letter or underscore, followed by any number of letters, numbers, or underscores.
es: Un nombre de constante válido empieza con una letra o un caracter de subrayado, seguido por cualquier número de letras, números, o subrayados.

source: As a regular expression, it would be expressed thus: [a-zA-Z_\x7f-\xff][a-zA-Z0-9_\x7f-\xff ]*
es: Se podrían expresar mediante la siguiente expresión regular: [a-zA-Z_\x7f-\xff][a-zA-Z0-9_\x7f-\xff ]*

source: For our purposes here, a letter is a-z, A-Z, and the ASCII characters from 127 through 255 (0x7f-0xff).
es: Para nuestros propósitos, entenderemos como letra los carácteres a-z, A-Z, y los ASCII del 127 hasta el 255 (0x7f-0xff).

source: The scope of a constant is global--you can access it anywhere in your script without regard to scope.
es: El alcanze de una constante es global, Es decir, es posible acceder a ellas sin preocuparse por el ámbito de alcance.

source: You can define a constant by using the define() -function.
es: Se puede definir una constante usando la función define().

source: Once a constant is defined, it can never be changed or undefined.
es: Una vez definida, no puede ser modificada ni eliminada.

source: Only scalar data (boolean, integer, float and string) can be contained in constants.
es: Solo se puede definir como constantes valores escalares (boolean, integer, float y string).

source: You can get the value of a constant by simply specifying its name.
es: Para obtener el valor de una constante solo es necesario especificar su nombre.

source: Unlike with variables, you should not prepend a constant with a $.
es: A diferencia de las variables, no se tiene que especificar el prefijo $.

source: Use get_defined_constants() to get a list of all defined constants.
es: Tambien se puede utilizar la función constant(), para obtener el valor de una constante, en el caso de que queramos expresarla de forma dinámica Usa la función get_defined_constants() parar obtener una lista de todas las constantes definidas.

source: Constants and (global) variables are in a different namespace.
es: Las contantes y las variables (globales) se encuentran en un espacio de nombres distinto.

source: This implies that for example TRUE and $TRUE are generally different.
es: Esto implica que por ejemplo TRUE y $TRUE son diferentes.

source: If you use an undefined constant, PHP assumes that you mean the name of the constant itself.
es: Si usas una constante todavia no definida, PHP asume que estás refiriéndote al nombre de la constante en si.

source: A notice will be issued when this happens.
es: Se lanzará un aviso si esto sucede.

source: Use the defined() -function if you want to know if a constant is set.
es: Usa la función defined() para comprobar la existencia de dicha constante.

source: These are the differences between constants and variables:
es: Estas son las diferencias entre constantes y variables:

source: Constants do not have a dollar sign ($) before them;
es: Las constantes no son precedidas por un símbolo de dolar ($)

source: Constants may only be defined using the define() function, not by simple assignment;
es: Las contantes solo pueden ser definidas usando la función() define, nunca por simple asignación

source: Constants may be defined and accessed anywhere without regard to variable scoping rules;
es: Las constantes pueden ser definidas y accedidas sin tener en cuenta las reglas de alcanze del ámbito.

source: Constants may not be redefined or undefined once they have been set; and
es: Las constantes no pueden ser redefinidas o eliminadas despues de establecerse; y

source: Constants may only evaluate to scalar values.
es: Las constantes solo puede albergar valores escalares

source: Example 9-1.
es: Ejemplo 9-1.

source: Variables from outside PHP
es: Variables externas a PHP

source: Predefined constants
es: Constantes predefinidas

source: Chapter 9.
es: Capítulo 9.

source: Constants
es: Constantes

source: Many of these constants, however, are created by various extensions, and will only be present when those extensions are available, either via dynamic loading or because they have been compiled in.
es: PHP ofrece un largo número de constantes predefinidas a cualquier script en ejecución.

source: For example, the value of __LINE__ depends on the line that it 's used on in your script.
es: Muchas de estas constantes, sin embargo, son creadas por diferentes extensiones, y solo estarán presentes si dichas extensiones están disponibles, bien por carga dinámica o porque has sido compiladas.

source: A list of predefined constants is available in the section Reserved predefined constants.
es: Se puede encontrar una lista de constantes predefinidas en la seccion Constantes predefinidas.

source: Expressions
es: Expresiones

source: Expressions are the most important building stones of PHP.
es: Las expresiones son la piedra angular de PHP.

source: In PHP, almost anything you write is an expression.
es: En PHP, casi cualquier cosa que escribes es una expresión.

source: The simplest yet most accurate way to define an expression is "anything that has a value".
es: La forma más simple y ajustada de definir una expresión es "cualquier cosa que tiene un valor".

source: The most basic forms of expressions are constants and variables.
es: Las formas más básicas de expresiones son las constantes y las variables.

source: When you type "$a = 5", you're assigning '5 'into $a. '5', obviously, has the value 5, or in other words '5' is an expression with the value of 5 (in this case, '5 'is an integer constant).
es: Cuando escribes "$a = 5", estás asignando '5 'a $a. '5', obviamente, tiene el valor 5 o, en otras palabras '5' es una expresión con el valor 5 (en este caso, '5 'es una constante entera).

source: After this assignment, you' d expect $a's value to be 5 as well, so if you wrote $b = $a, you'd expect it to behave just as if you wrote $b = 5.
es: Después de esta asignación, esperarás que el valor de $a sea 5 también, de manera que si escribes $b = $a, esperas que se comporte igual que si escribieses $b = 5.

source: In other words, $a is an expression with the value of 5 as well.
es: En otras palabras, $a es una expresión también con el valor 5.

source: If everything works right, this is exactly what will happen.
es: Si todo va bien, eso es exactamente lo que pasará.

source: Slightly more complex examples for expressions are functions.
es: Las funciones son un ejemplo algo más complejo de expresiones.

source: For instance, consider the following function:
es: Por ejemplo, considera la siguiente función:

source: Assuming you' re familiar with the concept of functions (if you're not, take a look at the chapter about functions), you'd assume that typing $c = foo() is essentially just like writing $c = 5, and you're right.
es: Suponiendo que estés familiarizado con el concepto de funciones (si no lo estás échale un vistazo al capítulo sobre funciones), asumirás que teclear $c = foo() es esencialmente lo mismo que escribir $c = 5, y has acertado.

source: Functions are expressions with the value of their return value.
es: Las funciones son expresiones que valen el valor que retornan.

source: Since foo() returns 5, the value of the expression'foo() 'is 5.
es: Como foo() devuelve 5, el valor de la expresión 'foo() 'es 5.

source: Usually functions don 't just return a static value but compute something.
es: Normalmente las funciones no devuelven un valor fijo, sino que suele ser calculado.

source: Of course, values in PHP don' t have to be integers, and very often they aren't.
es: Desde luego, los valores en PHP no se limitan a enteros, y lo más normal es que no lo sean.

source: PHP supports three scalar value types: integer values, floating point values and string values (scalar values are values that you can't'break 'into smaller pieces, unlike arrays, for instance).
es: PHP soporta tres tipos escalares: enteros, punto flotante y cadenas (los tipos escalares son aquellos cuyos valores no pueden 'dividirse 'en partes menores, no como los arrays, por ejemplo).

source: PHP also supports two composite (non-scalar) types: arrays and objects.
es: PHP también soporta dos tipos compuestos (no escalares): arrays y objetos.

source: Each of these value types can be assigned into variables or returned from functions.
es: Se puede asignar cada uno de estos tipos de valor a variables o bien retornarse de funciones, sin ningún tipo de limitación.

source: So far, users of PHP / FI 2 shouldn 't feel any change.
es: Hasta aquí, los usuarios de PHP / FI 2 no deberían haber notado ningún cambio.

source: However, PHP takes expressions much further, in the same way many other languages do.
es: Sin embargo, PHP lleva las expresiones mucho más allá, al igual que otros lenguajes.

source: PHP is an expression-oriented language, in the sense that almost everything is an expression.
es: PHP es un lenguaje orientado a expresiones, en el sentido de que casi todo es una expresión.

source: Consider the example we' ve already dealt with, '$a = 5 '.
es: Considera el ejemplo anterior '$a = 5'.

source: It' s easy to see that there are two values involved here, the value of the integer constant '5 ', and the value of $a which is being updated to 5 as well.
es: Es sencillo ver que hay dos valores involucrados, el valor de la constante entera '5', y el valor de $a que está siendo actualizado también a 5.

source: But the truth is that there' s one additional value involved here, and that's the value of the assignment itself.
es: Pero la verdad es que hay un valor adicional implicado aquí, y es el valor de la propia asignación.

source: The assignment itself evaluates to the assigned value, in this case 5.
es: La asignación misma se evalúa al valor asignado, en este caso 5.

source: In practice, it means that '$a = 5', regardless of what it does, is an expression with the value 5.
es: En la práctica, quiere decir que '$a = 5', independientemente de lo que hace, es una expresión con el valor 5.

source: Thus, writing something like '$b = ($a = 5)' is like writing '$a = 5; $b = 5; '(a semicolon marks the end of a statement).
es: De esta manera, escribir algo como '$b = ($a = 5)' es como escribir '$a = 5; $b = 5; '(un punto y coma marca el final de una instrucción).

source: Since assignments are parsed in a right to left order, you can also write '$b = $a = 5'.
es: Como las asignaciones se evalúan de derecha a izquierda, puedes escribir también '$b = $a = 5'.

source: Another good example of expression orientation is pre - and post-increment and decrement.
es: Otro buen ejemplo de orientación a expresiones es el pre y post incremento y decremento.

source: Users of PHP / FI 2 and many other languages may be familiar with the notation of variable+ + and variable--.
es: Los usuarios de PHP / FI 2 y los de otros muchos lenguajes les sonará la notación variable+ + y variable--.

source: These are increment and decrement operators.
es: Esto son las operaciones de incremento y decremento.

source: In PHP / FI 2, the statement '$a++' has no value (is not an expression), and thus you can't assign it or use it in any way.
es: En PHP / FI 2, la instrucción '$a++' no tiene valor (no es una expresión), y no puedes asignarla o usarla de ningún otro modo.

source: PHP enhances the increment / decrement capabilities by making these expressions as well, like in C.
es: PHP mejora las características del incremento / decremento haciéndolos también expresiones, como en C.

source: In PHP, like in C, there are two types of increment - pre-increment and post-increment.
es: En PHP, como en C, hay dos tipos de incremento - pre-incremento y post-incremento.

source: Both pre-increment and post-increment essentially increment the variable, and the effect on the variable is idential.
es: Ambos, en esencia, incrementan la variable y el efecto en la variable es idéntico.

source: The difference is with the value of the increment expression.
es: La diferencia radica en el valor de la propia expresion incremento.

source: Pre-increment, which is written '++$variable', evaluates to the incremented value (PHP increments the variable before reading its value, thus the name'pre-increment').
es: El preincremento, escrito '++$variable', se evalúa al valor incrementado (PHP incrementa la variable antes de leer su valor, de ahí el nombre 'preincremento').

source: Post-increment, which is written '$variable++' evaluates to the original value of $variable, before it was incremented (PHP increments the variable after reading its value, thus the name'post-increment').
es: El postincremento, escrito '$variable++', se evalúa al valor original de $variable antes de realizar el incremento (PHP incrementa la variable después de leer su valor, de ahí el nombre 'postincremento').

source: A very common type of expressions are comparison expressions.
es: Un tipo muy corriente de expresiones son las expresiones de comparación.

source: These expressions evaluate to either 0 or 1, meaning FALSE or TRUE (respectively).
es: Estas expresiones se evalúan a 0 o 1, significando FALSO (FALSE) o CIERTO (TRUE), respectivamente.

source: PHP supports (bigger than), = (bigger than or equal to), == (equal), != (not equal), (smaller than) and = (smaller than or equal to).
es: PHP soporta (mayor que), = (mayor o igual que), == (igual que), != (distinto), (menor que) y = (menor o igual que).

source: These expressions are most commonly used inside conditional execution, such as if statements.
es: Estas expresiones se usan frecuentemente dentro de la ejecución condicional como la instrucción if.

source: The last example of expressions we 'll deal with here is combined operator-assignment expressions.
es: El último tipo de expresiones que trataremos, es la combinación operador-asignación.

source: You already know that if you want to increment $a by 1, you can simply write '$a++' or '++$a '.
es: Ya sabes que si quieres incrementar $a en 1, basta con escribir '$a++' o ++$a '.

source: But what if you want to add more than one to it, for instance 3?
es: Pero qué pasa si quieres añadir más de 1, por ejemplo 3?

source: You could write '$a++' multiple times, but this is obviously not a very efficient or comfortable way.
es: Podrías escribir '$a++' múltiples veces, pero no es una forma de hacerlo ni eficiente ni cómoda.

source: A much more common practice is to write '$a = $a + 3'. '$a + 3' evaluates to the value of $a plus 3, and is assigned back into $a, which results in incrementing $a by 3.
es: Una práctica mucho más corriente es escribir '$a = $a + 3'. '$a + 3' se evalúa al valor de $a más 3, y se asigna de nuevo a $a, lo que resulta en incrementar $a en 3.

source: In PHP, as in several other languages like C, you can write this in a shorter way, which with time would become clearer and quicker to understand as well.
es: En PHP, como en otros lenguajes como C, puedes escribir esto de una forma más concisa, que con el tiempo será más clara y también fácil de entender.

source: Adding 3 to the current value of $a can be written '$a += 3'.
es: Añadir 3 al valor actual de $a se puede escribir como '$a += 3'.

source: This means exactly "take the value of $a, add 3 to it, and assign it back into $a".
es: Esto quiere decir exactamente "toma el valor de $a, súmale 3, y asígnalo otra vez a $a".

source: In addition to being shorter and clearer, this also results in faster execution.
es: Además de ser más corto y claro, también resulta en una ejecución más rápida.

source: The value of '$a += 3', like the value of a regular assignment, is the assigned value.
es: El valor de '$a += 3', como el valor de una asignación normal y corriente, es el valor asignado.

source: Notice that it is NOT 3, but the combined value of $a plus 3 (this is the value that's assigned into $a).
es: Ten en cuenta que NO es 3, sino el valor combinado de $a más 3 (ése es el valor asignado a $a).

source: Any two-place operator can be used in this operator-assignment mode, for example '$a -= 5' (subtract 5 from the value of $a), '$b *= 7 '(multiply the value of $b by 7), etc.
es: Cualquier operación binaria puede ser usada en forma de operador-asignación, por ejemplo '$a -= 5' (restar 5 del valor de $a), '$b *= 7 '(multiplicar el valor de $b por 5), etc.

source: There is one more expression that may seem odd if you haven 't seen it in other languages, the ternary conditional operator:
es: Hay otra expresión que puede parecer extraña si no la has visto en otros lenguaes, el operador condicional ternario:

source: The following example should help you understand pre - and post-increment and expressions in general a bit better:
es: El siguiente ejemplo te ayudará a comprender un poco mejor el pre y post incremento y las expresiones en general:

source: function double( $i) {return $i*2;} $b = $a = 5; / * assign the value five into the variable $a and $b * / $c = $a++; / * post-increment, assign original value of $a (5) to $c * / $e = $d = ++$b; / * pre-increment, assign the incremented value of $b (6) to $d and $e * / / * at this point, both $d and $e are equal to 6 * / $f = double($d++); / * assign twice the value of $d emphasis before / emphasis the increment, 2*6 = 12 to $f * / $g = double(++$e); / * assign twice the value of $e emphasis after / emphasis the increment, 2*7 = 14 to $g * / $h = $g += 10; / * first, $g is incremented by 10 and ends with the value of 24. the value of the assignment (24) is then assigned into $h, and $h ends with the value of 24 as well. * /
es: function double( $i) {return $i*2;} $b = $a = 5; / * asignar el valor cinco a las variables $a y $b * / $c = $a++; / * postincremento, asignar el valor original de $a (5) a $c * / $e = $d = ++$b; / * preincremento, asignar el valor incrementado de $b (6) a $d y a $e * / / * en este punto, tanto $d como $e son iguales a 6 * / $f = double($d++); / * asignar el doble del valor de $d antes del incremento, 2*6 = 12 a $f * / $g = double(++$e); / * asignar el doble del valor de $e después del incremento, 2*7 = 14 a $g * / $h = $g += 10; / * primero, $g es incrementado en 10 y termina valiendo 24. después el valor de la asignación (24) se asigna a $h, y $h también acaba valiendo 24. * /

source: In the beginning of the chapter we said that we 'll be describing the various statement types, and as promised, expressions can be statements.
es: Al principio del capítulo hemos dicho que describiríamos los distintos tipos de instrucciones y, como prometimos, las expresiones pueden ser instrucciones.

source: However, not every expression is a statement.
es: Sin embargo, no todas las expresiones son instrucciones.

source: In this case, a statement has the form of 'expr' ';' that is, an expression followed by a semicolon.
es: En este caso, una instrucción tiene la forma 'expr' ';', es decir, una expresión seguida de un punto y coma.

source: In '$b=$a=5 ;', $a=5 is a valid expression, but it's not a statement by itself. '$b=$a=5;' however is a valid statement.
es: Por otro lado '$b=$a=5:' sí es una instrucción válida.

source: One last thing worth mentioning is the truth value of expressions.
es: Una última cosa que vale la pena mencionar, es el valor booleano de las expresiones.

source: In many events, mainly in conditional execution and loops, you 're not interested in the specific value of the expression, but only care about whether it means TRUE or FALSE.
es: El valor de verdad de las expresiones en PHP se calcula de forma similar a perl.
